In [1]:
import pandas as pd
import matplotlib as plt

In [7]:
#import csv file
salary_data = pd.read_csv('Data Files/Clean_Payroll.csv')
salary_data.head()

   Unnamed: 0   Tm  Attendance  Attend/G Est. Payroll  Year
0           0  ARI     2091685     25823    $59984226  2006
1           1  ATL     2550524     31488    $90156876  2006
2           2  BAL     2153139     26582    $72585582  2006
3           3  BOS     2930588     36180   $120099824  2006
4           4  CHC     3123215     38558    $94424499  2006

In [15]:
#define x and y points
pd.to_numeric(salary_data['Attend/G'])

0      25823
1      31488
2      26582
3      36180
4      38558
5      36511
6      26353
7      24667
8      25980
9      32049
10     14372
11     37318
12     16946
13     42059
14     46402
15     28835
16     28210
17     41723
18     52445
19     24403
20     33356
21     22982
22     32837
23     30632
24     38646
25     42589
26     16901
27     29491
28     28422
29     26581
       ...
300    25138
301    24950
302    26819
303    36487
304    39906
305    21559
306    23384
307    19650
308    32130
309    31173
310    28477
311    31577
312    37236
313    45720
314    21405
315    28575
316    24246
317    34440
318    37820
319    18784
320    23644
321    27768
322    29030
323    27999
324    41546
325    42525
326    15879
327    33462
328    41878
329    30641
Name: Attend/G, Length: 330, dtype: int64